
/**************************** (C) COPYRIGHT 2019 ****************************
* 设计师:   Tigerots
* 创建时间: 2019.10.23
* 功能描述: MBI5024驱动程序
*       
*****************************************************************************
* ********************************修改历史记录********************************
* 修改时间: 
* 版本号:
* 修改内容:
*****************************************************************************/

//宏定义防止重入
#ifndef  __MYMBI5024_H__
#define  __MYMBI5024_H__
 

#ifndef  MYMBI5024
#define	 __MYMBI5024_EXT__  extern
#else
#define	 __MYMBI5024_EXT__ 
#endif


//头文件
#include "includes.h"



//函数声明
__MYMBI5024_EXT__ void RefreshDisplay(void);
__MYMBI5024_EXT__ void LedDisplay(u8 color, u8 Codeid);

#endif
